/*
1. Є такий код:

let x = 1;
let y = 2;

let res1 = // Допишіть код, необхідно використовувати змінні x і y
console.log(res1); // "12"
console.log(typeof res1); // "string"

let res2 = // Допишіть код, необхідно використовувати змінні x і y
console.log(res2); // "true2"
console.log(typeof res2); // "string"

let res3 = // Допишіть код, необхідно використовувати змінні x і y
console.log(res3); // true
console.log(typeof res3); // "boolean"

let res4 = // Допишіть код, необхідно використовувати змінні x і y
console.log(res4); // NaN
console.log(typeof res4); // "number"
Допишіть код, щоб в консолі браузера з'явилися рядки, які написані в коментарях.
=============================================================*/
let x = 1;
let y = 2;

let res1 = x + "" +y;

console.log(res1);
console.log(typeof res1);

let res2 = String(y > x) + y;

console.log(res2);
console.log(typeof res2);

let res3 = y != x;

console.log(res3);
console.log(typeof res3);

let res4 = parseInt((x+y)/0);

console.log(res4);
console.log(typeof res4);

/*
2. Користувач вводить число (використовуйте prompt ()). Необхідно перевірити чи є введене число
	a) парним додатним;
	b) кратним числу 7.
Результат перевірки вивести в консоль.
=============================================================*/
let UserNumb = prompt("Write an even positive number that is a multiple of 7");

console.log(UserNumb > 0 && UserNumb % 2 === 0 && UserNumb % 7 === 0);

/*
3. Створіть порожній масив;
1) У перший елемент масиву запишіть будь-яке число;
2) У другій елемент масиву запишіть будь-який рядок;
3) У третій елемент масиву запишіть будь-логічне значення;
4) У четвертий елемент масиву запишіть значення null;
5) Виведіть на екран число елементів, яке зберігається в масиві;
6) Запитайте у користувача ввести будь-яке значення і запишіть це значення в п'ятий елемент масиву;
7) Виведіть на екран п'ятий елемент масиву.
8) Видаліть 1-ий елемент масиву і виведіть масив на екран.
=============================================================*/
let MyArr = [];

MyArr[0] = Math.floor(Math.random() * 100);
MyArr[1] = String("RandNum" + MyArr[0]);
MyArr[2] = MyArr[0] > 50;
MyArr[3] = null;

alert(MyArr.length);

MyArr[4] = prompt("Write any value", String("Example:" + MyArr[0]));

delete MyArr[1]; //якщо, "1-й елемент" - рахувати як MyArr[0],то застосовуємо MyArr.shift();

alert(MyArr);

/*
4. Напишіть програму, яка для об’єднує всі наявні елементи масиву в стрічку і розділяє їх символом “*”.
Початковий масив:
let cities = ["Rome", "Lviv", "Warsaw"];
Результуючий масив:
"Rome*Lviv*Warsaw"
=============================================================*/
let cities = ["Rome", "Lviv", "Warsaw"];

console.log(cities.join("*").split()); // .join() - зрівнює в один рядок і розділяє "*", split() - повертає в масив;

/*
5. Використовуючи функцію prompt() задайте користувачу питання про досягнення ним повнолітнього віку. Результат запишіть в змінну isAdult. В залежності від отриманого значення виведіть відповідне повідомлення про статус особи. Наприклад: при виконанні умови вік більше 18 вивести “Ви досягли повнолітнього віку”. Якщо вік менше 10 років вивести “Ви ще надто молоді”, 
=============================================================*/
let isAdult = prompt("Вкажіть скільки Вам років");
let teenager = 18 - isAdult;
let ageUa = [" рік", " роки", " років"];

switch (true) {
    case (teenager == 1):
        ageUa0 = ageUa[0];
      break;
    case (teenager >= 2 && teenager <= 4):
        ageUa0 = ageUa[1];
      break;
    default:
        ageUa0 = ageUa[2];
  };

if (isAdult >= 18) {
    alert("Ви досягли повнолітнього віку");
} else if (isAdult < 10) {
    alert("Ви ще надто молоді")
} else {
    alert("Через " + teenager + ageUa0 + "  Ви станете повнолітнім")
}

/*
6. Користувач вводить три довжини сторін трикутника (використовуйте prompt () три рази для введення кожної сторони).
Необхідно 
	a) визначити і вивести в консоль площу трикутника 
	b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
Здійснювати перевірку чи введені користувачем значення додатні, в іншому випадку вивести 'Incorrect data‘. Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми (наприклад:  8.42355465 =>  8.424).  
=============================================================*/
let a = +prompt("Введіть довжину сторони A трикутника");
let b = +prompt("Введіть довжину сторони B трикутника");
let c = +prompt("Введіть довжину сторони C трикутника");

if (isNaN(a + b + c) || a <= 0 || b <= 0 || c <= 0) {
	alert("Incorrect data!!");
	location.reload();
};

// do { 
// 	alert("Incorrect data!!");
// } while (isNaN(a + b + c) || a <= 0 || b <= 0 || c <= 0); ???- Чому не працює -???

let p = (a + b + c)/2;
let s = (p * ((p - a) * (p - b) * (p - c))) ** 0.5;

console.log(s.toFixed(3)); //console.log(parseInt(s * 1000) / 1000);
console.log(s == a*b*0.5 || s == b*c*0.5 || s == a*c*0.5);

/*
7. Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання. Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.
В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
В діапазоні годин 11-17 – має виводитися привітання “Доброї дня”
В діапазоні годин 17-23 – має виводитися привітання “Доброї вечора”.
=============================================================*/
var ToDay = new Date();
var timeNow = ToDay.getHours();

switch (true) {
	case (timeNow >= 5 && timeNow < 11):
		alert("Доброго ранку");
		break;
	case (timeNow >= 11 && timeNow < 17):
		alert("Доброго дня");
		break;
	case (timeNow >= 17 && timeNow < 23):
		alert("Доброго вечора");
		break;
	default: 
		alert("Доброї ночі");
}

if ((timeNow >= 5 && timeNow < 11)) {
	alert("Доброго ранку");
} else if ((timeNow >= 11 && timeNow < 17)) {
	alert("Доброго дня");
} else if ((timeNow >= 17 && timeNow < 23)) {
	alert("Доброго вечора");
} else {
	alert("Доброї ночі");
}
